Revit 2024 API
FabricationPartBrowserChangedEventArgs.GetFabricationPartTypeIds Method
 Returns set of fabrication part types in use in the routing solution mode.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public ISet<ElementId> GetFabricationPartTypeIds()
Visual Basic
Public Function GetFabricationPartTypeIds As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetFabricationPartTypeIds()
Return Value
 The set of ElementIds for for fabrication part types that is in use in routing solution mode.
See Also
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace